Revit 2026 API

# ConnectorDemand Property

---

The demand of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Demand { get; }
```
```vb
Public ReadOnly Property Demand As Double
	Get
```
```cpp
public:
property double Demand {
	double get ();
}
```
```fsharp
member Demand : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's domain is not DomainPiping. |
| InvalidOperationException | Thrown on failure to get demand. |

Instantaneous demand at this connector, calculated according to system.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace